{
  "response": {
    "status": "ok",
    "userTier": "developer",
    "total": 1,
    "content": {
      "id": "sport/live/2020/oct/05/french-open-2020-kvitova-dimitrov-djokovic-live",
      "type": "liveblog",
      "sectionId": "sport",
      "sectionName": "Sport",
      "webPublicationDate": "2020-10-05T16:48:33Z",
      "webTitle": "French Open 2020: Djokovic, Tsitsipas and Kvitova through – as it happened",
      "webUrl": "https://www.theguardian.com/sport/live/2020/oct/05/french-open-2020-kvitova-dimitrov-djokovic-live",
      "apiUrl": "https://content.guardianapis.com/sport/live/2020/oct/05/french-open-2020-kvitova-dimitrov-djokovic-live",
      "fields": {
        "headline": "French Open 2020: Djokovic, Tsitsipas and Kvitova through – as it happened",
        "thumbnail": "https://media.guim.co.uk/4aa5ad22f9eea55959969fead8bab78d0b03b821/0_205_3500_2100/500.jpg",
        "bodyText": "That is all from me on the liveblog today. Thanks for following and we will be back tomorrow. Here are the stories of the day so far: Novak Djokovic reached his 14th Roland Garros quarter-final with a 6-4 6-3 6-3 win over Karen Khachanov. Petra Kvitova eased into her second Roland Garros quarter-final, beating Zhang Shuai of China 6-2 6-4. She will face Laura Siegemund, who beat Paula Badosa 7-5 6-2. Stefanos Tsitsipas eased past Grigor Dimitrov 6-3 7-6(7) 6-2 to reach his first Roland Garros quarter-final. He will meet Andrey Rublev, a 6-7(4) 7-5 6-4 7-6(3) winner over Marton Fucsovics. Novak Djokovic: It was definitely a closer match than maybe the score indicates. It was a straight sets win but it was quite even... I kind of managed to break his resistance towards the end of the match. If you play later in the day with the roof closed, there’s literally no bounce at all so he could pick up the ball on the rise from the backhand corner. I managed to find the way to win and that’s what matters. Novak Djokovic can now sit back and relax and he will face the winner of the fourth round between Pablo Carreno Busta and Daniel Altmaier. Of course, a match-up with Carreno Busta would mean a swift re-match after his US Open default. Djokovic’s win marks his 14th quarter-final at Roland Garros, which ties Rafael Nadal yesterday as the joint most of all time. Federer is third with 12 quarter-final appearances. The next highest number is Andre Agassi, Christian Boussus, Roy Emerson and Guillermo Vilas with 9. It really highlights how incredible Djokovic and Federer have been on clay throughout their careers. And yet they both have one Roland Garros title each. It just so happens that, time after time, they have both been blocked by the man who is by far the greatest clay courter of all time. Novak Djokovic’ stat line: 70% first serve points won 59% second serve points won 23/35 (66%) net points won 48% receiving points won 44 winners 28 unforced errors A quality performance from Novak Djokovic against his first top quality opponent. He seemed to lose focus a little in the final set, but he switched it back on so easily. Djokovic improves to 14-1 in slams this year as he continues to chase #18. With some top quality serving, Novak Djokovic easily secured a love hold to consolidate the break and move to within a game of the quarter-final. Djokovic leads 6-4 6-3 5-3. To nobody’s surprise, Novak Djokovic has immediately broken back to re-establish his third set lead. The rise in the Serb’s intensity was clear as he cut out errors and risky shots, forcing Khachanov to hit through him. Djokovic raised a break point at 30-40 after grinding out a forehand unforced error from Khachanov. The Russian responded on the break point with a big combo of forehands, eventually forcing a Djokovic error with a searing cross-court forehand. From deuce, Djokovic pulled off an incredible return, retrieving an excellent Khachanov wide serve before forcing an error with a deep backhand that kissed the baseline. On the second break point, Khachanov fired a forehand long. Djokovic leads 6-4 6-3 *4-3. Novak Djokovic stops the run of games at three with a hold for 6-4 6-3 3-3, but it was not easy. Djokovic led by 40-15, a lead that was scuppered by some forceful forehands from Khachanov. On the first deuce, Djokovic sent an overhead flying long. He saved the following break point with, of course, a point-ending drop-shot. After shanking a forehand well wide on the second deuce, Djokovic found a serve-forehand combination on consecutive points before firing an ace to hold. Djokovic seemed to lose some timing in the middle of the game, but he showed up on all the big points to keep himself in the lead. Karen Khachanov did indeed hold serve for his third successive game from 0-2 down, sealed with a nice wrong-footing backhand winner off another failed Djokovic drop shot. He punctuated the hold with a cry of allez, as he should. Khachanov should be anticipating a rise in intensity across the net. Djokovic will not want to complicate this more than he already has. Djokovic leads 6-4 6-3 *2-3. Novak Djokovic’s focus just wavered a little and now things are suddenly back on serve. From 30-15, he dumped another drop shot into the net, netted a backhand off a forceful return from Khachanov and then dumped a routine backhand into the net. Let’s see if Khachanov can run with this momentum. Djokovic leads 6-4 6-3 2-2. While most players would credit their own fight and determination, here is a very humble Andrey Rublev on how he has been able to overturn so many tight moments on serve. Q. Your opponents served for the set eight times in general in this tournament so far. They only won one of these games. What is it that makes you play your best tennis in those critical moments? ANDREY RUBLEV: To be honest, I don’t know. I mean, is just happen. I think I was really, really, really lucky. I think it was not me who did something. It just happen. If you take all the matches before, most of the times it was never happening, and now in one week it happens more than ever. I don’t know. I think it’s more lucky than something that I play different. I don’t really play in that moments different. I was playing the same style, the same shots. So was more about luck. Maybe a little bit conditions because here is cold. It’s not easy to serve hard every time. To be able to hold the serve is not that easy. Things are only moving in one direction on Chatrier as Novak Djokovic takes a 2-0 lead to open the third set. Djokovic broke serve with another of his beloved drop shot winners after a long point. He then rolled through an easy hold to consolidate the break. After some great serving, Khachanov netted a routine backhand before muttering angrily to himself. In truth, there isn’t much he can do when his serve is under fire from the best returner in the world. Q. We’re having a debate on the RG Live at Roland Garros show tonight about social media and whether players should do more or less during slams on social media. What is your opinion on the topic? STEFANOS TSITSIPAS: Very interesting topic. Me personally, I don’t really use social media during slams. I try and avoid using any form or any app that is linked to social media. I think it keeps me more sane. Yeah, some of the social media, Twitter for example, can be very toxic. Just too much information honestly. You don’t want to be thinking about stuff like this when you’re on the court. I might update sometimes my Instagram for all the fans and all people that came out that day to support me and obviously show some love and appreciation to what I do. Social media is important. Obviously it’s your brand, you can’t really avoid that. It is your brand. You are someone who can influence people through social media. The only thing is that you have to do it the right way, not overuse the platform. There are some debates about social media, as you said. I think when you spend countless hours per day scrolling through your social media, of course it’s not healthy for you. For your mental health as well. For me has been the case in plenty of times. Especially during quarantine, I found myself using a lot social media, which is not as pleasant of an experience as people think it is. Just have to use everything with regulation and not overdo things. I think that’s the basic rule of life: keep a balance, keep a balance in your life. Especially, again, I want to say the hate that you receive sometimes on social media can make it very uncomfortable and very bad experience to be out there. Sometimes it’s not bad to be silent. With an unreturned serve out wide, Novak Djokovic holds to 15 and establishes a 6-4 6-3 lead against Karen Khachanov. He stands one set away from another quarter-final. Khachanov recovers from 0-40 down, saving four break points in total to force Djokovic to serve out the set. Good tennis from the Russian, who found his first serve when he really needed it and saved most of the set points by standing on top of the baseline and swinging on the front foot. From deuce, he cracked a lovely angled crosscourt forehand winner before holding with an ace down the T. Djokovic leads 6-4 *5-3. Djokovic holds to move to within a game of a two set lead, but he certainly did not make his life simple. He lost focus at the beginning of the service game and really should have paid for it. Djokovic opened the game by missing a forehand, double faulting and then missing a backhand to fall down 0-40. He tightened up his game and saved all three break points extremely well, only for a forehand to clip the net and fly long. On his fourth break point on the game, Khachanov criminally missed a routine return. Buoyed by his opponent’s inability to convert break point, Djokovic landed two first serves and slotted his first forehand behind Khachanov to escape. Djokovic leads 6-4 5-2*. Karen Khachanov’s serve was again under fire, but this time he survives with another hold. This time, he had some help from the world number one. From deuce, Djokovic netted yet another drop shot attempt and then he blazed a backhand long. Djokovic leads 6-4 *4-2. Novak Djokovic consolidates the break with few problems, closing it off to 30 with a forehand drive volley winner after a big serve out wide. Djokovic leads 6-4 4-1*. Novak Djokovic breaks for a 6-2 3-1* lead. Djokovic continues to be relentless with the drop shots but after they cost him more than a few points in the first set, they are starting to flow. He reached 0-30 with a lovely effort from his backhand side. From 15-30, Djokovic’s return did the rest. He first landed a great forehand second serve return at Khachanov’s laces, easily putting away the following short ball. At 15-40, he deflected a very good wide first serve from the Russian with a searing angled forehand return. Khachanov tried to chase it down and sent his forehand long. This is getting comfortable. Novak Djokovic holds for a 2-1 lead in set two. After being pulled to 30-30 by a nice Khachanov dropshot, Djokovic responded with what he thought was a sliding ace out wide. Instead, it was called a let. After rolling his eyes and laughing at what he thought was an error, he stepped up and slammed two consecutive unreturned serves to hold. Nicely done. Djokovic leads Khachanov 6-2 2-1* Novak Djokovic and Karen Khachanov trade holds to open the second set. A good effort from the Russian to shake off the previous service game to survive a tight service game from deuce. After missing a backhand at 40-30, he responded with a bold point-ending forehand down-the-line at deuce before drawing an error from Djokovic’s backhand. Novak Djokovic takes the first set 6-4 on Karen Khachanov. After all of that hard work from Khachanov, he throws in a really bad service game, closing off the set with a routine backhand error and then a double fault. Not good enough. Djokovic, however, returned extremely well and that double fault was probably consequence of too many returns landing at his laces. Karen Khachanov breaks Novak Djokovic back for 4-5. This has been an intense start on Chatrier and despite falling down a break, Khachanov has forced Djokovic to work for every single return point. In this return game, Khachanov finally started to read Djokovic’s serve and after reaching 30-30, he pounced with a huge forehand down the line. Djokovic saved the break point with a sweeping move to the net after a huge forehand, finishing with a nice volley. But then he went for two successive drop shots and lost two more points with them. He netted the first at deuce, then on the second break point Khachanov chased down both drop shot and lob before landing a lovely dipping backhand passing shot with his back to the net. Great work. Thanks Rob, this is Tumaini Carayol again and I have returned in time for a pivotal game in set one as Novak Djokovic breaks Karen Khachanov for 5-3. Despite failing to convert two break points with two poor drop shots in the previous service game, Djokovic continues to look for his drop shot. After a long deuce game and two more missed break points, he landed a lovely dropper at deuce. On his third break point, he stepped into the court, moved Khachanov from side to side and eventually elicited a backhand forced error. He will serve for the set. Hello all, Rob Bleaney here stepping in for Tumaini at the end of a gripping sixth game of the opening set. Djokovic had two break points, but two imperfect drop shots from the Serb allowed Khachanov back to deuce and the Russian held his nerve and his serve to level the scores at 3-3. Novak Djokovic and Karen Khachanov roll through the first few holds under the Chatrier roof, with Djokovic sealing a hold for 2-1 with an ace down the T. I am off to grab a quick lunch, then I will be back to see out the rest of this match. Novak Djokovic is now entering Chatrier, where he will face his first top 20 opponent of the week in Karen Khachanov. On the outside courts, play will not resume before 4pm. All credit to both Stefanos Tsitsipas and Andrey Rublev, who faced each other in the final of Hamburg 8 days ago last Sunday after this tournament had already started. It seemed like a bad idea to be competing so close to a best of 5 slam event, and even more when Rublev narrowly won their tough three set match in the final. Many people thought they would eventually hit a wall physically or mentally. Both players arrived in Paris on Sunday night, had one day to adjust to the conditions and then were thrown into the first round last Tuesday. Not surprisingly, they both immediately fell down two sets, Rublev also down 5-2 in the third set to Sam Querrey. They recovered and have soared ever since, demonstrating ample mental toughness en-route to the quarters. Now one will reach their first Roland Garros semi-final. Rublev’s best slam results before this week were two US Open quarterfinals, one of which came last month. Tsitsipas reached the Australian Open semi-final in 2019. Grigor Dimitrov had his chances in the second set, but Tsitsipas is just so much tougher in tight moments. After that second set, that was an unimpressive way to surrender the match. An excellent effort for Tsitsipas to reach the quarters. He has had plenty of troubles at slam events since his breakthrough semi-final at the Australian Open in 2019 and this is the first time he has returned to the quarters since then. On the outside courts, play has been suspended and the courts are covered. Rain is expected all afternoon so this could be a long day. Stefanos Tsitsipas holds to stand one game from his first slam quarter-final. Grigor Dimitrov did a good job of putting pressure on Tsitsipas and forcing him to deuce, but the Greek evaded it with two timely first serves. After an unreturned first serve at deuce, Dimtrov lashed out at a forehand while on the move and narrowly sent it wide. Tsitsipas leads 6-3 7-6(9) 5-2*. Grigor Dimitrov saves break point to keep himself in the match. Things looked to be going in a different, sadder direction though. From 40-15 up, he bailed out of consecutive points with limp dropshots into the net. Then he sprayed a forehand error to face break point at advantage. However, Dimitrov responded well with a couple of hulking point-ending forehands before finally landing a good drop shot to close it off. On Chatrier, Stefanos Tsitsipas is running away with the third set against Grigor Dimitrov. He leads 6-3 7-6(9) 4-1*. As he reaches his first Roland Garros quarter-final, Andrey Rublev is now 33-6 (85%) since the end of last year. He is one of the few young players to demonstrate consistency week after week. He will face the winner of Tsitsipas vs Dimitrov. Perhaps the most in-form player in the draw, the Russian makes good of his searing form by reaching his first quarters in Paris. However, it was so tough and Rublev was constantly chasing a lead throughout. He was down 2-5 in the second set, 1-3 in the third set and then *4-5 0-40 in the fourth set. You have to win the big points. On Lenglen, Andrey Rublev and Marton Fucsovics have battled all the way into a fourth set tiebreak after Fucsovics held three set points at 5-4. Rublev has once again stepped up under pressure and he has taken a big 5-2 lead. Joe Salisbury and Rajeev Ram fall in the men’s doubles quarterfinals. In the end, they lost a tough third set to 7th seeds Mate Pavic and Bruno Soares 6-4 4-6 7-5. Stefanos Tsitsipas takes the second set on a marathon tiebreak to lead Grigor Dimitrov 6-3 7-6(9). From 9-9, two forehands were the difference: Tsitsipas crushed an excellent wrong-footing forehand winner, then Dimitrov netted en easy forehand off a short ball on Tsitsipas’s third set point. The Greek’s superior toughness was the difference and now he is a set away from his first Roland Garros quarter-final. The tiebreak continues between Tsitsipas and Dimitrov, now 9-9 with everything on the line. After so little separated them through the first 10 points, at 5-5 Dimitrov missed an easy second serve return on his forehand to hand the Greek a set point. What followed was an incredible rally, with both players crushing the ball and defending so well, with Dimitrov eventually chasing down a Tsitsipas drop shot and slotting his backhand for clean winner. At 6-6, Dimitrov slipped and then sprayed a forehand long as he tried to regain his balance. He responded well again on the second set point at 6-7, pounding his backhand crosscourt and eventually rushing Tsitsipas, drawing a shanked error. At 7-7, a routine forehand error from Tsitsipas handed Dimitrov his first set point on his serve at 8-7, but then the Bulgarian netted a backhand slice. Dimitrov responded at 8-8 with a big unreturned serve to produce another set point, this time on Tsitsipas’s serve at at 9-8. He had the set on his racquet, but he sent a forehand wide for 9-9. Stefanos Tsitsipas forces a second set tiebreak on Chatrier after another tough hold. This time, under immense pressure from Dimitrov, Tsitsipas found himself 15-30 down. He responded by firing a big ace down the T, then he slipped into the net after another big serve and finished the point with a smooth volley. After multiple deuces followed, Tsitsipas dismounted with two successive service winners. His serving has been top class under pressure in this set. Tense moments for Stefanos Tsitsipas, who just successfully served to stay in the second set. Grigor Dimitrov is playing much better now and piling on the pressure late in the second set, but after reaching 30-30 on Tsitsipas’s service game, a loose error offered the Greek game point. He gratefully took it, firing down a big serve to hold. Dimitrov responded with a quick hold to put the pressure straight back on Tsitsipas. Tsitsipas leads 6-3 *5-6. On Chatrier, Stefanos Tsitsipas just cooly navigated a potentially complicated situation, finding three first serves from 15-30 down. He fired a serve-forehand 1-2 punch, then an unreturned serve, then he controlled the game point, eventually forcing a Dimitrov backhand error. Positive, proactive play from the Greek to keep this set in play against an improving Dimitrov. Tsitsipas leads 6-3 4-4. Joe Salisbury and Rajeev Ram have been pushed to a third set 6-4 4-6 by 7th seeds Mate Pavic and Bruno Soares. Andrey Rublev has been down so often throughout the past 9 days. He trailed Stefanos Tsitsipas 3-5 in the final of Hamburg last Sunday and returned to claim his first ATP 500 title. Two days later, after scurrying to Paris late on the opening day of play, he trailed by two sets and 5-2 in his first round against Sam Querrey. Today, Rublev has spent so much of this match chasing a deficit against an inspired Marton Fucsovics. His confidence is so palpable in the important moments and nobody is more aware of that right now than Fucsovics himself. Andrey Rublev finally pulls away against Marton Fucsovics to establish a two set lead at 6-7(3) 7-5 6-4. After losing his serve, Rublev immediately broke back, sealing an excellent, proactive return game with a searing forehand down-the-line winner. He served it out with easily, crushing an ace down the T on set point. The answer to that previous question: not very well. After a few sloppy errors, including a routine mis-timed forehand on break point, Andrey Rublev meekly hands the break back to Marton Fucsovics for 4-4. The pair have been playing for 2 hours 44 minutes now and the score remains perfectly even. Lenglen is a battle, but Andrey Rublev has finally edged ahead after spending so much of this match chasing Fucsovics down. Fucsovics led by a break early in the set, but a dogged Andrey Rublev has now won 3 games in a row to lead *4-3. Rublev’s relentless pressure on the Fucsovics backhand is starting to pay off and he broke serve after a shanked backhand error from the Hungarian. Rublev now leads 6-7(3) 7-5 *4-2. We’ll see how he reacts to finally being ahead. After struggling badly in Tsitsipas’s service games, Grigor Dimitrov can take a lot from how he ended the first set and was able to put pressure on the Greek, finally imposing his forehand in the baseline rallies. These first service games will be very important. Stefanos Tsitsipas has the trainer on-court for a medical timeout. He just received some eye-drops. First blood to Stefanos Tsitsipas, who takes the first set 6-3 against Grigor Dimitrov on Chatrier. Dimitrov certainly timed his charge on return well. After failing to get into any Tsitsipas service game since being up 0-30 in the opening game of the match, he burst to a 15-40 lead after an excellent wrong-footing forehand down-the-line winner. How well did Tsitsipas respond to the first pressure moments on his serve. He found two first serves on the break points, scuppering the first with a serve and forehand 1-2 punch and the second with an unreturned serve. Tsitsipas rode his luck on a third break point, slotting a backhand into the open court after Dimitrov had to chase down an unlucky net cord. Finally, after a big serve at deuce, Tsitsipas was able to serve out the set. A tough, tough hold by Dimitrov who recovered from 15-30 down to force Tsitsipas to serve out the set at *5-3. After pushing the Bulgarian to deuce with an excellent forehand passing shot, Tsitsipas was prowling, peppering his backhand and looking to move into the net. However, Tsitsipas dropped his approach shot just a little too short and Dimitrov responded with a lovely flicked backhand down-the-line passing shot. On game point, Dimitrov demonstrated his athleticism by soaking up pressure from Tsitsipas’s forehand before crunching a hefty crosscourt forehand to force a Tsitsipas error and hold. Stefanos Tsitsipas continues to have very few no problems on his service game. Behind some solid serving, he establishes a 5-2* lead with a love hold. Dimitrov will serve to stay in the set. On court 14, Rajeev Ram and Joe Salisbury lead 6-4 *0-1 on Mate Pavic and Bruno Soares. They are chasing their first French Open semi-final, which would complete their set of men’s doubles slam semis. Grigor Dimitrov did well to recover from break point down to put himself ont he board but Stefanos Tsitsipas continues to breeze through his early service games. This time, he advances to 15 after an unreturned first serve. Tsitsipas leads Dimitrov 4-1. This time, Andrey Rublev makes Marton Fucsovics pay for failing to serve out the set. From 2-5 down, Rublev breezes through 5 games in a row to take set two 7-5 and level the Hungarian at one set all. Rublev 6-7(3) 7-5 Fucsovics. Not a great start from Grigor Dimitrov on Chatrier, who double faulted from deuce in his opening game before shanking a forehand error down break point. Stefanos Tsitsipas happily welcomed that sloppiness from the Bulgarian, marching through a quick love hold to establish a quick, early lead. Tsitsipas 3-0 Dimitrov. On Lenglen, Marton Fucsovics has once again failed to serve out the set on Andrey Rublev as he chased a two-set lead at 7-6(3) *5-3. That could be costly. In Chatrier, the single-handed battle between Stefanos Tsitsipas and Grigor Dimitrov is just about to begin. Dimitrov had quite a simple draw, but he has taken advantage of it to reach the second week of Roland Garros for the first time. We’ll see what he can do against Tsitsipas on his favourite surface. Laura Siegemund of Germany is into her first career slam quarterfinal at the age of 32, beating Paula Badosa 7-5 6-2. It turned into quite a routine affair after she initially trailed 3-5 in the first set. Although ranked 66th, she is a well known threat on clay and with some big results on the surface in the past. She will face Petra Kvitova in the quarters. Amusingly, Siegemund brought a box of takeaway food with her onto the court and was munching on it between games. As she left the court, the umpire asked her what she had been eating and said: “I’ve seen some strange things, but I never saw a takeaway Chinese,” said the umpire. No problem for the 7th seed on her second attempt at serving it out, closed to love with a searing backhand down-the-line winner. Overall, an excellent and controlled performance from Kvitova. Incredibly, this is only Kvitova’s second quarter-final of her career at Roland Garros. The only other time she did so, she reached the semis in 2012. Petra Kvitova dragged herself to match point at 6-2 5-3* and advantage, only to hit three consecutive backhand errors and lose the game. She will now serve for the match for a second time at 6-2 *5-4. Petra Kvitova had been strolling to victory at 6-2 *5-2, but after a couple of errors some quality points from Zhang, she has been pegged back a break. Kvitova leads 6-2 5-3*. This has quietly been an incredible tournament for Marton Fucsovics, who upset Andrey Rublev’s countryman Daniil Medvedev in the first round to secure his first ever top 10 win. It was easy to put that win down to Medvedev’s struggles on clay but Fucsovics comfortably backed it up by reaching the fourth round without dropping a set. As noted during that win over Medvedev, Fucsovics is a really great story. He won junior Wimbledon and reached junior #1 aged 18 in 2010 but it wasn’t until the end of 2017, at 25 years old, that he finally made it into the top 100 after years of being stuck on the ATP Challenger circuit. Since he has made it there, he has been comfortable at the top. He has everything he needs to be successful here: a good serve and forehand, decent movement, lovely feel with his slice, drop shots and net play, and now a greater understanding of how to use his game against the best. The outstanding performances from sub top 100 players this week have been further affirmations of just how tough it is at the lower leagues of both men’s and women’s tennis. So many quality young players had similar struggles to Fucsovics but never made it. On Lenglen, the pair have traded holds to open the second set. Fucsovics leads Rublev 6-2 2-1*. Marton Fucsovics recovers from his first set hiccup to take the first set 7-6(3) on Andrey Rublev. Such a great burst of quality from Fucsovics to take the tiebreak from 4-3 in the first. At 4-3, he chased down a drop volley after a long point and delicately slipped an angled forehand past Rublev at the net. On the next point he showed supreme athleticism, defending a couple of brutal Rublev forehands before unloading on a cross-court forehand of his own. On set point he crushed a forehand down the line, slipped into the net a finished with a lovely backhand volley. Laura Siegemund completes the comeback on Simonne-Mathieu, recovering from 3-5 down to take the first set 7-5 on Paula Badosa. Andrey Rublev and Marton Fucsovics are into a first set tiebreak on Lenglen. A good recovery from Fucsovics after squandering 13 points in a row from 5-3 to 5-6 0-15. This has been really impressive from Petra Kvitova so far. She opens the second set with an immediate break. After squandering two break points and being pegged back to deuce, she crushed a forehand down-the-line winner and then unloaded on a backhand return winner on consecutive points to easily secure the break. Things are flowing and Zhang cannot do much right now. The same cannot be said for other the players in Paris. Three players were simultaneously serving for the set a few minutes ago but only Kvitova was able to see her set out. On Lenglen, Marton Fucsovics lead 5-3* before losing 12 points in a row. He now finds himself down *5-6 and serving to stay in the set. Paula Badosa could not close out Laura Siegemund at *5-3 in the first set and has been pulled back to 5-5. Despite waiting in the cold for a good 6 minutes during Zhang’s medical timeout, Petra Kvitova had no problems serving out a very solid first set to 30, sealing it with a quality second serve that forced an error from Zhang. Kvitova leads Zhang 6-2. On the other courts, 13th seed Andrey Rublev is currently down *5-4 to in-form Hungarian Marton Fucsovics on Lenglen. On Simonne-Mathieu, 22 year-old Paula Badosa leads *5-3 on Laura Siegemund and she will serve for the set. Zhang Shuai has now called the trainer for what appears to be an issue with her right thigh. She has gone off the court for a medical timeout. Zhang Shuai saves double break point to hold serve, forcing Kvitova to serve it out at *5-2. On the first set point, Kvitova just narrowly failed to complete a nice move to the forecourt, dropping a backhand volley into the net. On the second, Zhang swept forward to the net herself, perfectly timing a lovely backhand drive volley. After a wayward forehand return from Kvitova, she has now established some momentum even if the match moves into a third set. Kvitova leads *5-2. This has not been a good start for Zhang Shuai, but she is a really talented player with a great story. Between 2008 and 2015, Zhang lost in her first fourteen slam first rounds despite numerous good results on the WTA tour. Her struggles eventually led to her considering retirement at the end of 2015. Zhang’s family and close friend Sam Stosur convinced her to play on and she arrived at the 2016 Australian Open thinking she would give it one last try. Zhang drew world number two Simona Halep in the first round, and beat her in straight sets before reaching the quarters. After all those struggles at slams, she has now reached the second week of all but the US Open. Great effort from Kvitova to save break point with a big serve down the T before holding firm through a long deuce game to reach 5-1*. She served very well when needed. The conditions have forced Kvitova to be really disciplined and creative with her shot selection. She still has the power to hit through the courts, but she has stepped onto the court knowing that points simply will not come as easily for her as usual. If she tries to blast through opponents, she will lose. That is a completely different mentality than on faster courts when she can just spend the whole time on the front foot. We’re already seeing her playing the margins more by opening up the court with cross-court angles and choosing her moments to change directions very carefully. That was exemplified by her game point for 4-0, in which she was pushed back behind the baseline by a Zhang. Instead of crushing her backhand down-the-line, she slotted an angled backhand behind Zhang. Still, a good hold from Zhang to get on the board. Kvitova leads 4-1. Petra Kvitova did not have a similar quality start in Saturday’s match against 18 year old Leylah Fernandez, where she quickly found herself down 1-5 in the first set before facing two set points. However, it was really impressive how she dug herself out of that hole. Kvitova’s peerless ballstriking talent is well known to most but as she has grown up, she has learnt how to harness her weapons more consistently, to think more on-court and to problem solve in matches. Not many players have as many shots in their arsenal as Kvitova, who is very comfortable throwing in drop shots, slices, angles and moving into the net. That variety of shot helped her win 9 games in a row from 1-5 down on in her third round. Not many people fancied Kvitova this week in slow, wet conditions on a clay court at the start of last week, but she is still here and she looks good. After a couple of double faults from Zhang, Kvitova now leads *3-0 with a double break. This has been a quality start from Petra Kvitova on Chatrier, who broke in the opening game and then quickly held to consolidate for a 2-0 first set lead against Zhang Shuai, sealed with a beautiful running forehand cross-court winner. Hello! Welcome to day nine of our Roland Garros coverage as fourth round action comes to a conclusion. After a series of shock results in the women’s draw over the past couple of days, with 2018 champion Simona Halep, 2016 champion Garbine Muguruza and 5th seed Kiki Bertens being knocked out, we begin on Chatrier with one of the two remaining slam champions in the draw as Petra Kvitova takes on Zhang Shuai of China. Stefanos Tsitsipas will follow in a single-handed backhand duel against Grigor Dimitrov before Australian Open champions Novak Djokovic and Sofia Kenin finsh off play on Chatrier. While the women’s draw has quickly descended into chaos, with a new Roland Garros champion certain to be crowned, this week so far has been a stroll for Djokovic and Rafael Nadal. The question is who will first be able simply put them under any pressure at all. 15th seed Karen Khachanov of Russia will have his chance today. Today’s order of play: Court Philippe Chatrier [7] Petra Kvitova vs Shuai Zhang [18] Grigor Dimitrov vs [5] Stefanos Tsitsipas [1] Novak Djokovic vs [15] Karen Khachanov Fiona Ferro vs [4] Sofia Kenin Court Suzanne Lenglen Marton Fucsovics vs [13] Andrey Rublev [30] Ons Jabeur vs Danielle Collins [17] Pablo Carreno Busta vs Daniel Altmaier Court Simonne-Mathieu Laura Siegemund vs Paula Badosa [13] Kuzmova/Kr.Pliskova vs [4] Krejcikova/Siniakova [1]Cabal/Farah vs Nielsen/Puetz"
      },
      "isHosted": false,
      "pillarId": "pillar/sport",
      "pillarName": "Sport"
    }
  },
  "statusCode": 200
}
